Revit 2020 API
RoomTag Properties
The RoomTag type exposes the following members.
Properties
Name | Description
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
HasElbow
 Identifies if the tag's leader has an elbow point or not.
 (Inherited from SpatialElementTag.)
HasLeader
 Identifies if a leader is displayed for the tag or not.
 (Inherited from SpatialElementTag.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsInRoom
Identifies if the tag is located in a room.
IsOrphaned
 Identifies if the tag is orphaned or not.
 (Inherited from SpatialElementTag.)
IsTaggingLink
 Identifies if the tag has reference to a spatial element in a linked document or not.
 (Inherited from SpatialElementTag.)
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LeaderElbow
 The position of the leader's elbow (middle point).
 (Inherited from SpatialElementTag.)
LeaderEnd
 The position of the leader's end.
 (Inherited from SpatialElementTag.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
The location of the tag.
 (Inherited from SpatialElementTag.)
Name
A human readable name for the Element.
 (Inherited from Element.)
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
Room
The room that the tag is associated with.
RoomTagType
The tag type.
TaggedLocalRoomId
The ElementId of the tagged room.
TaggedRoomId
The LinkElementId of the tagged room.
TagHeadPosition
 The position of the tag's head.
 (Inherited from SpatialElementTag.)
TagOrientation
 The orientation of the tag.
 (Inherited from SpatialElementTag.)
TagText
 The text displayed by the tag.
 (Inherited from SpatialElementTag.)
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
View
 The view in which the tag was placed.
 (Inherited from SpatialElementTag.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
RoomTag Class
Autodesk.Revit.DB.Architecture Namespace